---
kind: method
id: M:Autodesk.Revit.DB.Transform1D.SetToIdentity
source: html/2dd1bcb6-d3ad-3440-3040-3501a8d989aa.htm
---
# Autodesk.Revit.DB.Transform1D.SetToIdentity Method

Set this TrfUV to the identity transform

## Syntax (C#)
```csharp
public Transform1D SetToIdentity()
```

## Returns
Returns a pointer to "this" Transform1D .